export const text = {
    HTML: "웹 페이지의 구조를 정의하는 기본적인 언어로, 웹 페이지의 구조적 뼈대를 구축하는 데 사용됩니다.\n 저는 시멘틱 마크업을 중시하여 웹 접근성과 SEO 최적화를 고려한 웹 페이지 구조를 설계합니다.",
    CSS: "웹 페이지의 스타일링을 담당하며, 웹 디자인의 시각적 요소를 구현하는 데 사용됩니다.\n 저는 반응형 웹 디자인을 활용하여 다양한 화면 크기에서 최적화된 레이아웃을 제공합니다.\n 또한, CSS 전처리기를 활용해 유지보수가 용이한 스타일링을 합니다.",
    JavaScript: "웹 페이지에 동적이고 인터랙티브한 요소를 추가하는 언어로, 동적 웹 페이지를 구축하는 데 사용됩니다.\n 저는 주로 DOM 조작을 통해 상호작용적인 UI를 구현하며, 이벤트 처리, 비동기 요청 처리 등을 경험했습니다.\n 또한, TypeScript를 활용하여 더 안전하게 코드를 작성할 수 있습니다.",
    React: "컴포넌트 기반의 라이브러리로, 효율적이고 재사용 가능한 UI를 구축하는 데 사용됩니다. \n 저는 주로 React를 사용하여 반응형 웹 사이트를 개발합니다.\n 반대로, 라이브러리나 프레임워크 없이 웹 사이트 개발이 가능합니다.",
}